//=============================================================================
//
// アイテムy処理 [item.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _ITEM_H_
#define _ITEM_H_ 

//=============================================================================
//インクルードファイル
//=============================================================================
#include "scene2d.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define ITEM_SIZE_X 40.0f	//アイテムのX軸のサイズ
#define ITEM_SIZE_Y 40.0f	//アイテムのY軸のサイズ
#define ITEM_SIZE D3DXVECTOR3(ITEM_SIZE_X,ITEM_SIZE_Y,0.0f)	//アイテムのサイズ

//=============================================================================
//アイテムクラス
//=============================================================================
class CItem :public CScene2D
{
public:
	CItem();
	~CItem();

	CItem *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);


private:
};

#endif // !_ITEM_H_
