//=============================================================================
//
// アイテム処理 [item.cpp]
// Author : 山田陵太
//
//=============================================================================
#include "item.h"
#include "player.h"

//=============================================================================
//アイテムクラスのコンストラクタ
//=============================================================================
CItem::CItem()
{
}

//=============================================================================
//アイテムクラスのデストラクタ
//=============================================================================
CItem::~CItem()
{
}

//=============================================================================
//アイテムクラスのクリエイト処理
//=============================================================================
CItem * CItem::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	CItem *pItem = new CItem;

	if (pItem)
	{
		pItem->SetPos(pos);
		pItem->SetSize(size);
		pItem->Init();
	}
	else
	{
		return NULL;
	}
	return pItem;
}

//=============================================================================
//アイテムクラスの初期化処理
//=============================================================================
HRESULT CItem::Init(void)
{
	//CScene2Dの初期化
	CScene2D::Init();

	SetColor(COLOR_BLUE);
	return S_OK;
}

//=============================================================================
//アイテムクラスの終了処理
//=============================================================================
void CItem::Uninit(void)
{
	//CScene2Dの終了
	CScene2D::Uninit();
}

//=============================================================================
//アイテムクラスの更新処理
//=============================================================================
void CItem::Update(void)
{
	//CScene2Dの更新
	CScene2D::Update();

	CPlayer *pPlayer = NULL;

	//プレイヤーとの当たり判定
	pPlayer = (CPlayer *)JudgeCollision(OBJTYPE_PLAYER, GetPos(), GetSize());

	if (pPlayer)
	{
		//体力を回復させる
		pPlayer->AddLife(20);
		pPlayer->AddItemCount();
		//終了する
		Uninit();
	}
}

//=============================================================================
//アイテムクラスの描画処理
//=============================================================================
void CItem::Draw(void)
{
	//CScene2Dの描画
	CScene2D::Draw();
}
