//=============================================================================
//
// アイテム処理 [item.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _ITEM_H_
#define _ITEM_H_ 

//=============================================================================
//インクルードファイル
//=============================================================================
#include "scene2d.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define ITEM_SIZE_X 40.0f	//アイテムのX軸のサイズ
#define ITEM_SIZE_Y 40.0f	//アイテムのY軸のサイズ
#define ITEM_SIZE D3DXVECTOR3(ITEM_SIZE_X,ITEM_SIZE_Y,0.0f)	//アイテムのサイズ

//=============================================================================
//アイテムクラス
//=============================================================================
class CItem :public CScene2D
{
public:
	// アイテムの種類
	typedef enum
	{
		ITEM_COIN = 0,	// コイン
		ITEM_TREASURE,	// 宝
		ITEM_MAX
	}ITEM;
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CItem();
	~CItem();

	static CItem *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, ITEM type);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void DoubleScore(void);	//ダブルスコア関数
private:
	int m_nPoint;//ポイントの値保存
	ITEM m_pItem;//種類
	//=========================================================================
	//メンバ変数宣言
	//=========================================================================
	LPDIRECT3DTEXTURE9 m_pTexture;	//テクスチャポインタ
};

#endif // !_ITEM_H_
