//=============================================================================
//
// プレイヤー処理 [player.cpp]
// Author : 山田陵太
//
//=============================================================================
#include "player.h"
#include "manager.h"
#include "keyboard.h"
#include "debugfont.h"

//=============================================================================
//プレイヤークラスのコンストラクタ
//=============================================================================
CPlayer::CPlayer(int nPriority):CCharacter(nPriority)
{
}

//=============================================================================
//プレイヤークラスのデストラクタ
//=============================================================================
CPlayer::~CPlayer()
{
}

//=============================================================================
//プレイヤークラスのクリエイト処理
//=============================================================================
CPlayer * CPlayer::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	//インスタンス生成
	CPlayer *pPlayer = new CPlayer;

	if (pPlayer)
	{
		pPlayer->SetPos(pos);
		pPlayer->SetSize(size);
		pPlayer->Init();
	}
	return pPlayer;
}

//=============================================================================
//プレイヤークラスの初期化処理
//=============================================================================
HRESULT CPlayer::Init(void)
{
	CScene2D::Init();

	return S_OK;
}

//=============================================================================
//プレイヤークラスの終了処理
//=============================================================================
void CPlayer::Uninit(void)
{
	CScene2D::Uninit();
}

//=============================================================================
//プレイヤークラスの更新処理
//=============================================================================
void CPlayer::Update(void)
{
	//移動処理
	Move();

	if (CManager::GetKeyborad()->GetKeyBoardTrigger(DIK_NUMPAD2))
	{
		SetState(CHARACTER_STATE_DIED);
	}
	if (CManager::GetKeyborad()->GetKeyBoardTrigger(DIK_NUMPAD5))
	{
		SetState(CHARACTER_STATE_DAMAGE);
	}
	if (CManager::GetKeyborad()->GetKeyBoardTrigger(DIK_NUMPAD7))
	{
		SubLife(1);
	}
	if (CManager::GetKeyborad()->GetKeyBoardTrigger(DIK_NUMPAD8))
	{
		SetLife(0);
	}
	if (CManager::GetKeyborad()->GetKeyBoardTrigger(DIK_NUMPAD9))
	{
		AddLife(1);
	}

	//CScene2Dの更新処理
	CScene2D::Update();

	//状態判定処理
	if (DEATH(CheckState()))
	{//死んでいた場合
		return;
	}
	CDebugFont::Print(CDebugFont::DEBUG_LAYER_LEFT, "プレイヤーのHP:%d\n", GetLife());
}

//=============================================================================
//プレイヤークラスの描画処理
//=============================================================================
void CPlayer::Draw(void)
{
	CScene2D::Draw();
}

//=============================================================================
//プレイヤークラスの移動処理
//=============================================================================
void CPlayer::Move(void)
{
	//位置を取得
	D3DXVECTOR3 pos = GetPos();

	pos.x += 0.5f;

	//位置を設定
	SetPos(pos);
}

//=============================================================================
//プレイヤークラスの死亡処理
//死亡時に一回だけ行いたい処理をここに記述
//=============================================================================
void CPlayer::DiedProcess(void)
{
	//終了処理
	Uninit();
}