//=============================================================================
//
// マップ処理 [area1.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _AREA_BASE_H_
#define _AREA_BASE_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "main.h"
#include "polygon.h"
#include "map.h"

//=============================================================================
//マップクラス
//=============================================================================
class CAreaBase
{
public:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CAreaBase();
	~CAreaBase();

	virtual HRESULT Init(CMap::MAP_AREA Area_Type);
	virtual void Uninit(void);
	virtual void Update(void);
	virtual void Draw(void);
	bool Colljon(CPolygon * pPolygon);
	virtual void SetMap(void) = 0;
	virtual void SetMapStart(void);
	CMap::MAP_AREA GetArea(void);
	//=========================================================================
	//メンバ変数宣言
	//=========================================================================
protected:
	CPolygon *m_pPolygon[2];
	CMap::MAP_AREA m_Area_Type;
};
#endif