//=============================================================================
//
// キャラクター処理 [character.cpp]
// Author : 山田陵太
//
//=============================================================================
#include "character.h"

//=============================================================================
//キャラクタークラスのコンストラクタ
//=============================================================================
CCharacter::CCharacter(int nPriority) : CScene2D(nPriority)
{
	//メンバ変数の初期化
	m_state = CHARACTER_STATE_NORMAL;
	m_nLife = 0;
	m_nMaxLife = 0;
	m_nStateCounter = 0;
}

//=============================================================================
//キャラクタークラスのデストラクタ
//=============================================================================
CCharacter::~CCharacter()
{
}

//=============================================================================
//キャラクタークラスの状態判定処理
//m_stateを返す
//=============================================================================
CHARACTER_STATE CCharacter::CheckState(void)
{
	switch (m_state)
	{
	//通常状態
	case CHARACTER_STATE_NORMAL:
		break;

	//ダメージを受けた状態
	case CHARACTER_STATE_DAMAGE:
		SetColor(COLOR_ALPHA);

		m_nStateCounter++;

		if (m_nStateCounter >= 30)
		{
			SetColor(COLOR_WHITE);
			m_nStateCounter = 0;

			m_state = CHARACTER_STATE_NORMAL;
		}
		else if (m_nStateCounter % 10 <= 5)
		{
			SetColor(COLOR_ALPHA);
		}
		else
		{
			SetColor(COLOR_WHITE);
		}
		break;

	//死んでいる状態
	case CHARACTER_STATE_DIED:

		//死亡処理実行
		DiedProcess();

		break;
	}

	return m_state;
}

//=============================================================================
//キャラクタークラスの状態設定処理
//=============================================================================
void CCharacter::SetState(CHARACTER_STATE state)
{
	m_state = state;
}

//=============================================================================
//キャラクタークラスの状態取得処理
//=============================================================================
CHARACTER_STATE CCharacter::GetState(void)
{
	return m_state;
}

//=============================================================================
//キャラクタークラスの現在ライフ加算処理
//=============================================================================
void CCharacter::AddLife(const int nAddValue)
{
	m_nLife += nAddValue;

	//体力の最大値を超えた場合最大値に修正
	if (m_nLife > m_nMaxLife)
	{
		m_nLife = m_nMaxLife;
	}
}

//=============================================================================
//キャラクタークラスの現在ライフ減算処理
//=============================================================================
void CCharacter::SubLife(const int nSubValue)
{
	m_nLife -= nSubValue;
}

//=============================================================================
//キャラクタークラスの現在ライフ設定処理
//=============================================================================
void CCharacter::SetLife(const int nLife)
{
	m_nLife = nLife;

	//体力の最大値を超えた場合最大値に修正
	if (m_nLife > m_nMaxLife)
	{
		m_nLife = m_nMaxLife;
	}
}

//=============================================================================
//キャラクタークラスの最大ライフ設定処理
//=============================================================================
void CCharacter::SetMaxLife(const int nMaxLife)
{
	m_nMaxLife = nMaxLife;
}


//=============================================================================
//キャラクタークラスの現在ライフ取得処理
//=============================================================================
int CCharacter::GetLife(void)
{
	return m_nLife;
}

//=============================================================================
//キャラクタークラスの最大ライフ取得処理
//=============================================================================
int CCharacter::GetMaxLife(void)
{
	return m_nMaxLife;
}
