//=============================================================================
//
// 背景処理 [bg.cpp]
// Author : 山田陵太
//
//=============================================================================
#include "dollar.h"
#include "manager.h"
#include "renderer.h"
#include "scene2d.h"

//=============================================================================
//静的メンバ変数宣言
//=============================================================================
LPDIRECT3DTEXTURE9 CDollar::m_apTexture = NULL;	//テクスチャのポインタ

//=============================================================================
//背景クラスのコンストラクタ
//=============================================================================
CDollar::CDollar(int nPriority) : CScene(nPriority)
{
	//0クリア
	m_pScene2D = NULL;
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);
}

//=============================================================================
//背景クラスのデストラクタ
//=============================================================================
CDollar::~CDollar()
{
}

//=============================================================================
//背景クラスのクリエイト処理
//=============================================================================
CDollar * CDollar::Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 size)
{
	//背景クラスのポインタ変数
	CDollar *pDollar = NULL;

	//インスタンス生成
	pDollar = new CDollar;

	//メモリが確保できていたら
	if (pDollar)
	{
		pDollar->m_pos;
		//背景クラスの初期化処理呼び出し
		pDollar->Init();
	}

	return pDollar;
}

//=============================================================================
//背景クラスのテクスチャロード処理
//=============================================================================
HRESULT CDollar::Load(void)
{
	//デバイスの取得
	LPDIRECT3DDEVICE9 pD3DDevice = CManager::GetRenderer()->GetDevice();

	//テクスチャの読み込み
	D3DXCreateTextureFromFile(pD3DDevice, "data/Texture/UI/dollar.png", &m_apTexture);

	return S_OK;
}

//=============================================================================
//背景クラスのテクスチャ破棄処理
//=============================================================================
void CDollar::UnLoad(void)
{
	//テクスチャの破棄
	if (m_apTexture)
	{
		m_apTexture->Release();
		m_apTexture = NULL;
	}
}

//=============================================================================
//背景クラスの初期化処理
//=============================================================================
HRESULT CDollar::Init(void)
{
	//2Dポリゴンクラスのインスタンス生成
	m_pScene2D = CScene2D::Create(m_pos, DOLLAR_SIZE, CScene::PRIORITY_BG);

	if (m_pScene2D)
	{
		//テクスチャの割り当て
		m_pScene2D->BindTexture(m_apTexture);
	}

	return S_OK;
}

//=============================================================================
//背景クラスの終了処理
//=============================================================================
void CDollar::Uninit(void)
{
	if (m_pScene2D)
	{
		m_pScene2D->Uninit();
	}

	//オブジェクトの破棄
	SetDeathFlag();
}

//=============================================================================
//背景クラスの更新処理
//=============================================================================
void CDollar::Update(void)
{
	if (m_pScene2D)
	{
		m_pScene2D->SetPos(m_pos);
	}
}

//=============================================================================
//背景クラスの描画処理
//=============================================================================
void CDollar::Draw(void)
{
}
