//=============================================================================
//
// スコア処理 [score.h]
// Author : 山田陵太
//
//=============================================================================
#ifndef _SCORE_H_
#define _SCORE_H_

//=============================================================================
//インクルードファイル
//=============================================================================
#include "scene.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define SCORE_MAX_NUM 8	//スコアの最大桁数
#define SCORE_SIZE (D3DXVECTOR3(70.0f,64.0f,0.0f)) 

//=============================================================================
//前方宣言
//=============================================================================
class CNumber;

//=============================================================================
//スコアクラス
//=============================================================================
class CScore : public CScene
{
public:
	//=========================================================================
	//メンバ関数宣言
	//=========================================================================
	CScore(int nPriority = CScene::PRIORITY_UI);
	~CScore();

	static CScore *Create(D3DXVECTOR3 pos);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void AddScore(const int nScore);
	static int GetScore(void);
	static void SetScore(int nNum) { m_nScore = nNum; }

	CNumber *GetNumber(int nNum) { return m_apNumber[nNum]; }

private:
	//=========================================================================
	//メンバ変数宣言
	//=========================================================================
	static int m_nScore;	// スコアの総数
	int m_nAddScore;		// 加算用のスコア
	CNumber *m_apNumber[SCORE_MAX_NUM];	// ナンバークラスポインタ
	D3DXVECTOR3 m_pos;
};
#endif 