//=============================================================================
//
// UI処理 [ui.cpp]
// Author : 山田陵太
//
//=============================================================================
#include "ui.h"
#include "score.h"
#include "timer.h"
#include "dollar.h"
#include "number.h"
#include "manager.h"
#include "fade.h"

//=============================================================================
//静的メンバ変数宣言
//=============================================================================
CScore * CUi::pScore = NULL;
CTime * CUi::pTime = NULL;

//=============================================================================
//UIクラスのコンストラクタ
//=============================================================================
CUi::CUi()
{
	m_pDllar = NULL;
}

//=============================================================================
//UIクラスのデストラクタ
//=============================================================================
CUi::~CUi()
{
}

//=============================================================================
//UIクラスの初期化処理
//=============================================================================
HRESULT CUi::Init(void)
{
	pScore = CScore::Create(D3DXVECTOR3(SCREEN_WIDTH, 0.0f, 0.0f));
	pTime = CTime::Create();
	for (int nCount = SCORE_MAX_NUM - 1; -1 < nCount; nCount--)
	{
		if (pScore->GetNumber(nCount))
		{
			D3DXVECTOR3 pos = pScore->GetNumber(nCount)->GetPos();
			m_pDllar = CDollar::Create(D3DXVECTOR3(pos.x - 50.0f, pos.y, pos.z));
			break;
		}
	}

	return S_OK;
}

//=============================================================================
//UIクラスの終了処理
//=============================================================================
void CUi::Uninit(void)
{
}

//=============================================================================
//UIクラスの更新処理
//=============================================================================
void CUi::Update(void)
{
	if (pScore)
	{
		// スコアの更新
		pScore->Update();
	}

	if (pTime)
	{
		// 時間の減算
		pTime->SubTime();


		if (pTime->GetTime() <= 0)
		{
			//フェード情報を取得
			CFade *pFade = CManager::GetFade();

			if (pFade != NULL)
			{
				//フェードを行う
				pFade->SetFade(CManager::MODE_TYPE_RESULT);

				return;
			}
		}
	}

	if (m_pDllar)
	{
		for (int nCount = SCORE_MAX_NUM - 1; -1 < nCount; nCount--)
		{
			if (pScore->GetNumber(nCount))
			{
				D3DXVECTOR3 pos = pScore->GetNumber(nCount)->GetPos();
				m_pDllar->SetPos(D3DXVECTOR3(pos.x - 50.0f, pos.y, pos.z));
				break;
			}
		}

		m_pDllar->Update();
	}
}

//=============================================================================
//UIクラスの描画処理
//=============================================================================
void CUi::Draw(void)
{
}

//=============================================================================
//UIクラスのスコア取得処理
//=============================================================================
CScore * CUi::GetScore(void)
{
	return pScore;
}

//=============================================================================
//UIクラスのタイム取得処理
//=============================================================================
CTime * CUi::GetTime(void)
{
	return pTime;
}
